app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "password_digest" = '$2a$10$9jfXn9EDBpCu9ZJd9x9hc.cjbi1LQlKjV7JOe4uiQbJ7Majw542Ee', "remember_token" = '5OMEZ_xQGJVEVO8j1Q_sqA', "updated_at" = '2012-10-31 07:34:51.417463' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])